uhnp/src/Catalogs/ЭлементыФинансовыхОтчетов/ЭлементыФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыФинансовыхОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыБюджетов</owners>
  <owners>Catalog.ВидыФинансовыхОтчетов</owners>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовФинансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>Наименование для печати, представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйЗнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыВидаЭлемента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперандыФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операнд</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыТаблицы</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВОтдельнойКолонке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыОформления</name>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОформляемойОбласти</name>
      <type>
        <types>EnumRef.ТипыОформляемыхОбластейБюджетныхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеСтроки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеКолонки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПолейОтбораЭО</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоляОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиЗначений</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавляемыеЗначенияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ВидыЭлементовФинансовогоОтчета/ВидыЭлементовФинансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовФинансовогоОтчета</name>
  <enumValues>
    <name>ЗаголовокОтчета</name>
  </enumValues>
  <enumValues>
    <name>НередактируемыйТекст</name>
  </enumValues>
  <enumValues>
    <name>РедактируемыйТекст</name>
  </enumValues>
  <enumValues>
    <name>МонетарныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>НемонетарныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>СтатьяБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВсеСтатьиБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПоказательБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВсеПоказателиБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>НефинансовыйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>РедактируемоеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаПоказателиВСтроках</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаПоказателиВКолонках</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаСложная</name>
  </enumValues>
  <enumValues>
    <name>ЭлементТаблицы</name>
  </enumValues>
  <enumValues>
    <name>Колонки</name>
  </enumValues>
  <enumValues>
    <name>Строки</name>
  </enumValues>
  <enumValues>
    <name>НастройкаЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаТаблицы</name>
  </enumValues>
  <enumValues>
    <name>Измерение</name>
  </enumValues>
  <enumValues>
    <name>Группа</name>
  </enumValues>
  <enumValues>
    <name>ИтогПоГруппе</name>
  </enumValues>
  <enumValues>
    <name>ФормулаПоГруппе</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ЭлементыФинансовыхОтчетов/Forms/Группа/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Справочники.ЭлементыФинансовыхОтчетов.ФормаПриСозданииНаСервере(ЭтаФорма);
	Заголовок = Параметры.ВидЭлемента;
	Элементы.НаименованиеДляПечати.Доступность = ВыводитьЗаголовокЭлемента;
	ДополнительныйРежимФормы = Параметры.ДополнительныйРежимФормы;
	Элементы.ГруппаДопРеквизиты.Видимость = Параметры.ПоказатьКодСтрокиПримечание;
	Элементы.ОбратныйЗнак.Видимость = Параметры.ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ИтогПоГруппе;
	Элементы.Точность.Видимость = Параметры.ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ИтогПоГруппе;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.ЭлементыФинансовыхОтчетов.ФормаПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ, ДополнительныйРежимФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(АдресЭлементаВХранилище) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗаголовокЭлементаПриИзменении(Элемент)
	
	Элементы.НаименованиеДляПечати.Доступность = ВыводитьЗаголовокЭлемента;
	Объект.НаименованиеДляПечати = ?(ВыводитьЗаголовокЭлемента, Объект.НаименованиеДляПечати, "Группа");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ФинансоваяОтчетностьКлиент.ЗавершитьРедактированиеЭлементаОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
